Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/extra_social_welfare_benefits/island_allowance.html.txt.tmx
Source language: en
Languages: ga

source: Social welfare payments and living on a specified island
ga: Na híocaíochtaí leasa shóisialaigh le daoine a chónaíonn ar oileán sainithe

source: People living on islands can face extra expenses travelling to the mainland to avail of services
ga: Má tá tú ag fáil ceann de na híocaíochtaí leasa shóisialaigh liostaithe thíos agus tú i do chónaí ar oileáin áirithe amach ó chósta na hÉireann féadfaidh tú méadú a fháil ar a dtugtaí Liúntas Oileáin

source: If you are getting one of the social welfare payments listed below and living on certain islands off the coast of Ireland you can get an increase in your social welfare payment (sometimes referred to as an Island Allowance)
ga: Is féidir le daoine a mhaireann ar oileáin costais bhreise a bheith orthu ag taisteal go dtí an mhórthír chun úsáid a bhaint as seirbhísí

source: The purpose of the increase is to compensate for the additional costs of living on an island off the coast of Ireland
ga: Is mar gheall ar na costais bhreise a bhaineann le cónaí ar oileán amach ó chósta na hÉireann atá an méadú seo ann

source: Since March 2005, people getting certain pensions from another EU state are entitled to an increase for living on a specified island
ga: Ó Mhárta 2005, tá daoine a fhaigheann pinsin áirithe ó stát eile san AE i dteideal méadú a fháil má chónaíonn siad ar oileán sainithe

source: To qualify for an increase in the rate of your social welfare payment you must ordinarily live on a specified island off the coast of Ireland, be 66 years of age or over and getting one of the following payments:
ga: Le go mbeifeá i dteideal méadú a fháil ní mór gnáthchónaí a bheith ort ar oileán sainithe amach ó chósta na hÉireann, a bheith 66 bliain d'aois nó níos sine agus a bheith ag fáil ceann de na híocaíochtaí seo a leanas:

source: • Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: • Widow's, Widower's or Surviving Civil Partner's (Non-Contributory) Pension
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach)

source: • Widow’s/Widower’s Benefit under the Occupational Injuries Benefit Scheme
ga: • Sochar Baintrí/Baintrí Fir faoi Scéim na Sochar Gortuithe Ceirde

source: If you are 66 years of age or over and getting a comparable pension to those listed above from another EU State, you are also entitled to the increase
ga: Má tá tú 66 bliain d'aois nó níos sine agus tú ag fáil pinsin cosúil le ceann den chineál atá luaite thuas ó stát eile san AE, tá an méadú ag dul duit chomh maith

source: If you live on a specified island and are under 66 years of age you will qualify for an increase in your social welfare payment if you are getting one of the following social welfare payments:
ga: Má chónaíonn tú ar oileán sainithe agus tú faoi 66 bliain d'aois beidh méadú leasa shóisialaigh ag dul duit má tá tú ag fáil ceann de na híocaíochtaí leasa shóisialaigh seo a leanas:

source: If you are under 66 years of age and getting a comparable pension to those listed above from another EU State, you are also entitled to the increase
ga: Má tá tú 66 bliain d'aois nó níos sine agus tú ag fáil pinsin cosúil le ceann den chineál atá luaite thuas ó stát eile san AE, tá an méadú ag dul duit chomh maith

source: The Increase for Living on a Specified Island is €12.70
ga: Is é an ráta €12.70

source: There is no application form to get an increase in the rate of your social welfare payment for living on a specifed island
ga: Níl aon fhoirm iarratais ann le cur isteach ar mhéadú ráta i d'íocaíocht leasa shóisialaigh is tú i do chónaí ar oileán sainithe

source: You are assessed for an increase at the time of your application for a social welfare payment
ga: Nuair a chuireann tú isteach ar íocaíocht leasa shóisialaigh, déantar measúnú ort i gcomhair méadaithe freisin

source: If you are on a qualifying payment you automatically get the increase when you reach 66 years of age
ga: Má tá tú ag fáil ceann de na híocaíochtaí cuí gheobhaidh tú an méadú go huathoibríoch nuair a shroichfidh tú 66 bliain d'aois

source: If you have any questions about the increase in the rate of your social welfare payment for living on a specifed island or whether you are entitled to it, you should contact the section in the Department of Social Protection which pays your social welfare payment
ga: Má tá aon cheist agat faoin méadú leasa shóisialaigh do dhuine a chónaíonn ar oileán sainithe nó lena fháil amach an bhfuil a leithéid ag dul duit, ba chóir duit dul i dteagmháil leis an rannóg sa Roinn Coimirce Sóisialaí a íocann d'íocaíocht leasa shóisialaigh

source: A lo-call number may be provided
ga: Cuireann an Roinn Coimirce Sóisialaí uimhir teileafóin Lóghlao ar fáil
